/**
 * 正则校验
 * phone: 手机号 {number} 2018年4月最新手机号码的校验
 * isIdentityCard: 身份证校验
 * isResidence: 户口本
 * passport: 护照
 * methods: duckReg.phone.test(val)
 */
const duckReg = {
    phone: /^(13[0-9]|14[579]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9]|19[89])\d{8}$/,
    // email: /^\w+((-\w+)|(\.\w+))*\@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z0-9]+$/,
    // email: /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
    qq: /^[1-9]\d{4,10}$/,
    isIdentityCard: /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/,
    isResidence: /^[a-zA-Z0-9]{3,21}$/,
    passport: /^[A-Z][0-9A-Z]{6,8}$/,
    wrokCard: ''
}
module.exports = {
    reg: duckReg
}
